In [89]:
import pandas as pd
import numpy as np

In [103]:
df1=pd.read_csv(r'Bengaluru_House_Data.csv')

In [104]:
df1.head()

,area_type,availability,location,size,society,total_sqft,bath,balcony,price
0,Super built-up Area,19-Dec,Electronic City Phase II,2 BHK,Coomee,1056,2.0,1.0,39.07
1,Plot Area,Ready To Move,Chikka Tirupathi,4 Bedroom,Theanmp,2600,5.0,3.0,120.00
2,Built-up Area,Ready To Move,Uttarahalli,3 BHK,NaN,1440,2.0,3.0,62.00
3,Super built-up Area,Ready To Move,Lingadheeranahalli,3 BHK,Soiewre,1521,3.0,1.0,95.00
4,Super built-up Area,Ready To Move,Kothanur,2 BHK,NaN,1200,2.0,1.0,51.00

In [105]:
df1.groupby('area_type')['area_type'].agg('count')

area_type
Built-up  Area          2418
Carpet  Area              87
Plot  Area              2025
Super built-up  Area    8790
Name: area_type, dtype: int64

In [162]:
df2=df1.drop(columns=['area_type','availability','society','balcony'])
df2.head()

                   location       size total_sqft  bath   price
0  Electronic City Phase II      2 BHK       1056   2.0   39.07
1          Chikka Tirupathi  4 Bedroom       2600   5.0  120.00
2               Uttarahalli      3 BHK       1440   2.0   62.00
3        Lingadheeranahalli      3 BHK       1521   3.0   95.00
4                  Kothanur      2 BHK       1200   2.0   51.00

In [163]:
#df2.isna().sum()
df2.isnull().sum()

location       1
size          16
total_sqft     0
bath          73
price          0
dtype: int64

In [164]:
#np.where(df2['size'].isnull())
df2[df2['bath'].isnull()].index.tolist()

[56,
 81,
 224,
 344,
 579,
 669,
 702,
 801,
 941,
 1264,
 1267,
 1686,
 1724,
 1765,
 1775,
 1852,
 2264,
 2500,
 2563,
 2809,
 2862,
 2944,
 2998,
 3370,
 3544,
 3598,
 3862,
 4210,
 4346,
 4843,
 4894,
 4995,
 5333,
 5464,
 5498,
 5747,
 5918,
 6256,
 6343,
 6423,
 6481,
 6636,
 6719,
 6778,
 6873,
 6971,
 7398,
 7623,
 7680,
 7921,
 8020,
 8056,
 8275,
 8289,
 8306,
 8472,
 8565,
 8703,
 8783,
 9129,
 9437,
 9699,
 10330,
 10553,
 10634,
 10726,
 11019,
 11297,
 11496,
 11569,
 12768,
 12861,
 13240]

In [165]:
df2['bath'].fillna(int(df2['bath'].mean()),inplace=True)
df2.iloc[13240].bath

2.0

In [166]:
df2.isnull().sum()

location       1
size          16
total_sqft     0
bath           0
price          0
dtype: int64

In [167]:
df2.dropna(subset=['location'],inplace=True)
df2.isnull().sum()

location       0
size          16
total_sqft     0
bath           0
price          0
dtype: int64

In [241]:
df3=df2.dropna()

In [242]:
df3.shape

(13303, 5)

In [243]:
df3.head()

                   location       size total_sqft  bath   price
0  Electronic City Phase II      2 BHK       1056   2.0   39.07
1          Chikka Tirupathi  4 Bedroom       2600   5.0  120.00
2               Uttarahalli      3 BHK       1440   2.0   62.00
3        Lingadheeranahalli      3 BHK       1521   3.0   95.00
4                  Kothanur      2 BHK       1200   2.0   51.00

In [244]:
df3['size'].unique()

array(['2 BHK', '4 Bedroom', '3 BHK', '4 BHK', '6 Bedroom', '3 Bedroom',
       '1 BHK', '1 RK', '1 Bedroom', '8 Bedroom', '2 Bedroom',
       '7 Bedroom', '5 BHK', '7 BHK', '6 BHK', '5 Bedroom', '11 BHK',
       '9 BHK', '9 Bedroom', '27 BHK', '10 Bedroom', '11 Bedroom',
       '10 BHK', '19 BHK', '16 BHK', '43 Bedroom', '14 BHK', '8 BHK',
       '12 Bedroom', '13 BHK', '18 Bedroom'], dtype=object)

In [245]:
df3['size']=df3['size'].apply(lambda x:int(x.split(' ')[0]))
df3.rename(columns={'size':'bhk'})

<ipython-input-245-63b7e8fb9424>:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df3['size']=df3['size'].apply(lambda x:int(x.split(' ')[0]))

                       location  bhk total_sqft  bath   price
0      Electronic City Phase II    2       1056   2.0   39.07
1              Chikka Tirupathi    4       2600   5.0  120.00
2                   Uttarahalli    3       1440   2.0   62.00
3            Lingadheeranahalli    3       1521   3.0   95.00
4                      Kothanur    2       1200   2.0   51.00
...                         ...  ...        ...   ...     ...
13315                Whitefield    5       3453   4.0  231.00
13316             Richards Town    4       3600   5.0  400.00
13317     Raja Rajeshwari Nagar    2       1141   2.0   60.00
13318           Padmanabhanagar    4       4689   4.0  488.00
13319              Doddathoguru    1        550   1.0   17.00

[13303 rows x 5 columns]

In [246]:
df3['size'].unique()

array([ 2,  4,  3,  6,  1,  8,  7,  5, 11,  9, 27, 10, 19, 16, 43, 14, 12,
       13, 18], dtype=int64)

In [247]:
df3[df3['size']>20]

                       location  size total_sqft  bath  price
1718  2Electronic City Phase II    27       8000  27.0  230.0
4684                Munnekollal    43       2400  40.0  660.0

In [248]:
df3['total_sqft'].unique()

array(['1056', '2600', '1440', ..., '1133 - 1384', '774', '4689'],
      dtype=object)

In [249]:
def is_float(x):
    try:
        float(x)
    except:
        return False
    return True

In [250]:
df3[~df3['total_sqft'].apply(is_float)].head()

               location  size   total_sqft  bath    price
30            Yelahanka     4  2100 - 2850   4.0  186.000
56          Devanahalli     4  3010 - 3410   2.0  192.000
81          Hennur Road     4  2957 - 3450   2.0  224.500
122              Hebbal     4  3067 - 8156   4.0  477.000
137  8th Phase JP Nagar     2  1042 - 1105   2.0   54.005

In [251]:
def convert_to_float(x):
    tokens=x.split('-')
    if len(tokens)==2:    
        return (float(tokens[0])+float(tokens[1]))/2
    try:
        return float(x)
    except:
        return None

In [252]:
df3['total_sqft']=df3['total_sqft'].apply(convert_to_float)

<ipython-input-252-f2be7f8e0bb0>:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df3['total_sqft']=df3['total_sqft'].apply(convert_to_float)

In [253]:
df3['total_sqft'].unique()

array([1056. , 2600. , 1440. , ..., 1258.5,  774. , 4689. ])

In [254]:
df3.head()

                   location  size  total_sqft  bath   price
0  Electronic City Phase II     2      1056.0   2.0   39.07
1          Chikka Tirupathi     4      2600.0   5.0  120.00
2               Uttarahalli     3      1440.0   2.0   62.00
3        Lingadheeranahalli     3      1521.0   3.0   95.00
4                  Kothanur     2      1200.0   2.0   51.00

In [257]:
df3['price_per_sqft']=(df3['price']*100000)/(df3['total_sqft'])

<ipython-input-257-888fb48ab1ea>:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df3['price_per_sqft']=(df3['price']*100000)/(df3['total_sqft'])

In [258]:
df3.head()

                   location  size  total_sqft  bath   price  price_per_sqft
0  Electronic City Phase II     2      1056.0   2.0   39.07     3699.810606
1          Chikka Tirupathi     4      2600.0   5.0  120.00     4615.384615
2               Uttarahalli     3      1440.0   2.0   62.00     4305.555556
3        Lingadheeranahalli     3      1521.0   3.0   95.00     6245.890861
4                  Kothanur     2      1200.0   2.0   51.00     4250.000000

In [261]:
len(df3['location'].unique())

1304

In [ ]:
df3['loca